load the dataset and display its shape,columns,data types

In [1]:
import pandas as pd
import numpy as np
df=pd.read_csv("task.csv")
df

,user_id,age,salary,department,join_date,city,performance_score,experience_years,is_active
0,user_0,-5,₹50000,HR,2020/12/01,DELHI,3,five,True
1,U1001,30,45000,Finance,15/02/2021,Delhi,3,1,yes
2,U1002,30,25000,HR,NaN,Delhi,excellent,10,False
3,NaN,unknown,NaN,HR,invalid,Hyderabad,excellent,5,yes
4,NaN,NaN,120000.75,IT,NaN,DELHI,NaN,-1,False
...,...,...,...,...,...,...,...,...,...
995,NaN,60,₹50000,HR,15/02/2021,DELHI,2,five,NaN
996,U1996,NaN,NaN,IT,15/02/2021,Mumbai,NaN,5,no
997,user_997,unknown,25000,HR,invalid,Mumbai,3,5,True
998,U1998,-5,25000,NaN,15/02/2021,Bangalore,1,0,True
999,NaN,30,45000,HR,2022-01-15,Hyderabad,excellent,five,no

In [2]:
df.shape

(1000, 9)

In [3]:
df.columns

Index(['user_id', 'age', 'salary', 'department', 'join_date', 'city',
       'performance_score', 'experience_years', 'is_active'],
      dtype='object')

In [4]:
df.dtypes

user_id              object
age                  object
salary               object
department           object
join_date            object
city                 object
performance_score    object
experience_years     object
is_active            object
dtype: object

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 9 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   user_id            490 non-null    object
 1   age                886 non-null    object
 2   salary             689 non-null    object
 3   department         859 non-null    object
 4   join_date          781 non-null    object
 5   city               851 non-null    object
 6   performance_score  899 non-null    object
 7   experience_years   873 non-null    object
 8   is_active          800 non-null    object
dtypes: object(9)
memory usage: 70.4+ KB

In [6]:
df.describe()

,user_id,age,salary,department,join_date,city,performance_score,experience_years,is_active
count,490,886,689,859,781,851,899,873,800
unique,490,8,5,5,4,6,7,7,4
top,user_0,-5,45000,HR,2020/12/01,mumbai,5,3,False
freq,1,127,147,292,210,158,139,140,223

calculate the percentage of missing values for each column

In [7]:
(df.isnull().sum()/1000)*100

user_id              51.0
age                  11.4
salary               31.1
department           14.1
join_date            21.9
city                 14.9
performance_score    10.1
experience_years     12.7
is_active            20.0
dtype: float64

identify columns containing mixed datatypes

In [8]:
df.apply(lambda col: col.map(type).nunique())

user_id              2
age                  2
salary               2
department           2
join_date            2
city                 2
performance_score    2
experience_years     2
is_active            2
dtype: int64

clean user_id by replacing empty strings with nan and converting values to uppercase

In [9]:
#(df.replace(NaN,columns).uppercase())
df['user_id']=df['user_id'].replace("",np.nan).str.upper()
df['user_id']

0        USER_0
1         U1001
2         U1002
3           NaN
4           NaN
         ...
995         NaN
996       U1996
997    USER_997
998       U1998
999         NaN
Name: user_id, Length: 1000, dtype: object

convert age to numeric and replace invalid  values (negative or >100) with NaN

In [10]:
df['age']=pd.to_numeric(df['age'],errors='coerce')
df.loc[(df['age']<0) | (df['age']>100),'age']=np.nan
df['age']

0       NaN
1      30.0
2      30.0
3       NaN
4       NaN
       ...
995    60.0
996     NaN
997     NaN
998     NaN
999    30.0
Name: age, Length: 1000, dtype: float64

clean salary by removing currency symbols and converting it to numeric

In [11]:
df['salary']=(
    df['salary']
    .astype(str)
    .str.replace('₹','',regex=False)
    .replace('N/A',np.nan)
)
df['salary']=pd.to_numeric(df['salary'],errors='coerce')
df['salary']

0       50000.00
1       45000.00
2       25000.00
3            NaN
4      120000.75
         ...
995     50000.00
996          NaN
997     25000.00
998     25000.00
999     45000.00
Name: salary, Length: 1000, dtype: float64

convert join_date into datatime format handling multiple date formats

In [12]:
df['join_date']=pd.to_datetime(df['join_date'],errors='coerce',dayfirst=True)
df['joining_year']=df['join_date'].dt.year
df[['join_date', 'joining_year']]

     join_date  joining_year
0   2020-01-12        2020.0
1          NaT           NaN
2          NaT           NaN
3          NaT           NaN
4          NaT           NaN
..         ...           ...
995        NaT           NaN
996        NaT           NaN
997        NaT           NaN
998        NaT           NaN
999        NaT           NaN

[1000 rows x 2 columns]

extract joining year from the cleaned join_date

In [13]:
df['join_date']=pd.to_datetime(df['join_date'],format="%d-%m-%y",errors='coerce',dayfirst=True)
df['join_date']

0     2020-01-12
1            NaT
2            NaT
3            NaT
4            NaT
         ...
995          NaT
996          NaT
997          NaT
998          NaT
999          NaT
Name: join_date, Length: 1000, dtype: datetime64[ns]

In [14]:
df['joining_year']=df['join_date'].dt.year
df['joining_year']

0      2020.0
1         NaN
2         NaN
3         NaN
4         NaN
        ...
995       NaN
996       NaN
997       NaN
998       NaN
999       NaN
Name: joining_year, Length: 1000, dtype: float64

standarize department values by trimming spaces and converting to uppercase

In [15]:
df['department']=(
    df['department']
    .str.strip()
    .str.upper()
)
df['department']

0           HR
1      FINANCE
2           HR
3           HR
4           IT
        ...
995         HR
996         IT
997         HR
998        NaN
999         HR
Name: department, Length: 1000, dtype: object

normalize city names to a consistent case and spelling

In [16]:
df['city']=(
    df['city']
    .str.title()
    .str.strip()
)
df['city']

0          Delhi
1          Delhi
2          Delhi
3      Hyderabad
4          Delhi
         ...
995        Delhi
996       Mumbai
997       Mumbai
998    Bangalore
999    Hyderabad
Name: city, Length: 1000, dtype: object

convert performance score into numeric  by mapping text values to numbers

In [17]:
performance_map={'poor': 0, 'excellent': 1}

df['performance_score']=df['performance_score'].replace(performance_map)
df['performance_score']=pd.to_numeric(df['performance_score'],errors='coerce')
df['performance_score']

0      3.0
1      3.0
2      1.0
3      1.0
4      NaN
      ...
995    2.0
996    NaN
997    3.0
998    1.0
999    1.0
Name: performance_score, Length: 1000, dtype: float64

clean experience_years by converting text values to numeric and removing negatives

In [18]:
df['experience_years']=df['experience_years'].replace('five',5)
df['experience_years']=pd.to_numeric(df['experience_years'],errors='coerce')
df.loc[df['experience_years']<0,'experience_years']=np.nan
df.loc[df['experience_years']<0,'experience_years']

Series([], Name: experience_years, dtype: float64)

In [19]:
df['is_active'].value_counts(dropna=False)

is_active
False    223
no       206
NaN      200
True     188
yes      183
Name: count, dtype: int64

convert is_active values(yes/no/true/false) into boolean format

In [20]:
active_map = {
    "yes": True,
    "no": False,
    "true": True,
    "false": False,
    "1": True,
    "0": False
}

df['is_active'] = (
    df['is_active']
    .astype(str)
    .str.strip()
    .str.lower()
    .map(active_map)   # <-- IMPORTANT: map instead of replace
)

df['is_active'] = df['is_active'].astype('boolean')
df['is_active']

0       True
1       True
2      False
3       True
4      False
       ...
995     <NA>
996    False
997     True
998     True
999    False
Name: is_active, Length: 1000, dtype: boolean

identify and remove duplicate records based on user_id

In [21]:
df=df.drop_duplicates(subset='user_id')
df

,user_id,age,salary,department,join_date,city,performance_score,experience_years,is_active,joining_year
0,USER_0,NaN,50000.0,HR,2020-01-12,Delhi,3.0,5.0,True,2020.0
1,U1001,30.0,45000.0,FINANCE,NaT,Delhi,3.0,1.0,True,NaN
2,U1002,30.0,25000.0,HR,NaT,Delhi,1.0,10.0,False,NaN
3,NaN,NaN,NaN,HR,NaT,Hyderabad,1.0,5.0,True,NaN
5,USER_5,NaN,25000.0,IT,NaT,NaN,3.0,0.0,False,NaN
...,...,...,...,...,...,...,...,...,...,...
990,U1990,NaN,NaN,SALES,NaT,Hyderabad,NaN,NaN,False,NaN
991,U1991,45.0,NaN,HR,NaT,Mumbai,NaN,NaN,True,NaN
996,U1996,NaN,NaN,IT,NaT,Mumbai,NaN,5.0,False,NaN
997,USER_997,NaN,25000.0,HR,NaT,Mumbai,3.0,5.0,True,NaN
998,U1998,NaN,25000.0,NaN,NaT,Bangalore,1.0,0.0,True,NaN